Refactor architecture docs
